#[1] => [[1], []]
#[] => [[], []]
#a = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
#a = [1, 2, 3]
a =[]
f = len(a)
if f % 2 == 0:
    t = f // 2
else:
    t = f // 2 + 1
g = a[:t]
z = a[t:]
n = [g, z]
print(n)


# просив все таки чат GPT пояснити логіку , бо застряг на цій домашці , але просив поясннити лише логіку побудови, бо списки пішли тяжко, спочатку додавав елементи списку а не самі списки . потім ліпив умову , трохи зрозумів , але треба ще більше літератури читати , або більше практики
# за назви змінних памятаю , називав так щоб швидше проклацувати і пробувати